{
  "name": "drawer-sticky-demo",
  "files": [
    {
      "name": "drawer-sticky-demo.tsx",
      "content": "\"use client\"\n\nimport React from \"react\"\n\nimport { buttonStyles, Drawer } from \"ui\"\n\nexport default function DrawerStickyDemo() {\n  return (\n    <Drawer>\n      <Drawer.Trigger className={buttonStyles({ shape: \"circle\", appearance: \"outline\" })}>Open</Drawer.Trigger>\n      <Drawer.Content>\n        <Drawer.Header>The Beatles</Drawer.Header>\n        <Drawer.Body>\n          <div className=\"prose dark:prose-invert prose-zinc\">\n            <p>\n              Welcome to our Terms of Use. By accessing or using our services, you agree to be bound by these terms. If\n              you do not agree to these terms, please refrain from using our services.\n            </p>\n            <h3> User Obligations</h3>\n            <h4>Account Responsibility</h4>\n            <p>\n              When you create an account with us, you are responsible for maintaining the confidentiality of your\n              account and password.\n            </p>{\" \"}\n            <p>\n              You agree to accept responsibility for all activities that occur under your account. You must notify us\n              immediately of any breach of security or unauthorized use of your account.\n            </p>\n            <h4>Compliance with Laws</h4>\n            <p>\n              You agree to comply with all applicable laws, regulations, and policies in connection with your use of our\n              services. This includes adhering to intellectual property laws and refraining from any unlawful behavior\n              while using our platform.\n            </p>\n            <h3> Prohibited Activities</h3>\n            <p>\n              You are not permitted to access or attempt to access any of our services by any means other than through\n              the interface provided by us. Any form of hacking, bypassing, or circumventing our security protocols is\n              strictly prohibited.\n            </p>\n            <h4>Misuse of Content</h4>\n            <p>\n              You agree not to misuse, reproduce, distribute, or modify any content from our services unless explicitly\n              authorized by us. This includes engaging in activities such as scraping, data mining, or using automated\n              systems to extract data.\n            </p>\n            <h4>Harassment and Abuse</h4>\n            <p>\n              You are prohibited from using our services to harass, abuse, or harm other users. This includes sending\n              unsolicited messages, stalking, or engaging in any form of cyberbullying. We reserve the right to\n              terminate accounts found in violation of this policy.\n            </p>\n            <h4>Ownership of Content</h4>\n            <p>\n              All content, trademarks, service marks, logos, and other intellectual property displayed on our services\n              are the property of their respective owners. You may not use, copy, or distribute any content without\n              prior written permission from the owner.\n            </p>\n            <h4>User-Generated Content</h4>\n            <p>\n              By submitting content to our services, you grant us a worldwide, royalty-free, non-exclusive license to\n              use, distribute, modify, and display that content for the purpose of providing our services.\n            </p>\n            <p>\n              You retain all ownership rights to your content but agree to allow us to use it in accordance with these\n              terms.\n            </p>\n            <h3> Termination</h3>\n            <h4>Right to Terminate</h4>\n            We reserve the right to terminate or suspend your access to our services at any time, without notice, for\n            any reason, including but not limited to a breach of these terms. Upon termination, your right to use our\n            services will immediately cease.\n            <h4>Effect of Termination</h4>\n            Upon termination of your account, all provisions of these terms that, by their nature, should survive\n            termination shall remain in effect. This includes, but is not limited to, ownership provisions, warranty\n            disclaimers, and limitations of liability.\n            <h3> Limitation of Liability</h3>\n            <h4>Service Availability</h4>\n            We do not guarantee that our services will be available at all times or without interruption. We are not\n            liable for any downtime or technical issues that may prevent access to our services.\n            <h4>No Warranties</h4>\n            Our services are provided \"as is\" and \"as available\" without any warranties of any kind, whether express or\n            implied. We do not warrant that our services will meet your requirements or that they will be error-free or\n            secure.\n            <h4>Limitation of Damages</h4>\n            In no event shall we be liable for any indirect, incidental, special, consequential, or punitive damages\n            arising out of or related to your use of our services. This includes, but is not limited to, damages for\n            loss of profits, data, or other intangibles.\n            <h3> Changes to These Terms</h3>\n            We reserve the right to modify or replace these terms at any time. If a revision is material, we will\n            provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change\n            will be determined at our sole discretion.\n            <h3> Governing Law</h3>\n            These terms shall be governed and construed in accordance with the laws of [Your Jurisdiction], without\n            regard to its conflict of law provisions. Any disputes arising from or relating to these terms shall be\n            resolved in the courts of [Your Jurisdiction].\n            <h3> Contact Information</h3>\n            If you have any questions about these terms, please contact us at xxx@example.com.\n          </div>\n        </Drawer.Body>\n        <Drawer.Footer>\n          <Drawer.Close shape=\"circle\">Close</Drawer.Close>\n        </Drawer.Footer>\n      </Drawer.Content>\n    </Drawer>\n  )\n}\n"
    }
  ],
  "type": "components:demo",
  "componentPath": "components/docs/overlays/drawer/drawer-sticky-demo.tsx"
}